Dropbox/emacs/configuration (gh-N550jk's conflicted copy 2018-05-12).org
#+TITLE: Emacs Configuration

* Personal info

#+BEGIN_SRC emacs-lisp
      (setq user-full-name "Goncalo M. V. Henriques"
      user-mail-address "gmv.henriques@gmail.com")
#+END_SRC

* Use =sensible-defaults.el=

Use [[https://github.com/hrs/sensible-defaults.el][sensible-defaults.el]] for some basic settings.

#+BEGIN_SRC emacs-lisp
  (load-file "~/.emacs.d/sensible-defaults.el")
  (sensible-defaults/use-all-settings)
  (sensible-defaults/use-all-keybindings)
  (sensible-defaults/backup-to-temp-directory)
#+END_SRC

* Load-path

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/Dropbox/emacs/lisp")
#+END_SRC

* Configure =use-package=

Gradually moving to [[https://github.com/jwiegley/use-package][use-package]].

#+BEGIN_SRC emacs-lisp
  (unless (package-installed-p 'use-package)
	  (package-refresh-contents)
	  (package-install 'use-package))

  (require 'use-package)
#+END_SRC

Always compile packages, and use the newest version available ([[https://github.com/emacscollective/auto-compile][auto-compile]]).

#+BEGIN_SRC emacs-lisp
  (use-package auto-compile
    :ensure t
    :config (auto-compile-on-load-mode))
  (setq load-prefer-newer t)
#+END_SRC

* Configure =evil-mode=

[[https://github.com/emacs-evil/evil][Evil]] its a vim emulator.

#+BEGIN_SRC emacs-lisp
  (use-package evil
    :ensure t
    :init
    (evil-mode 1))
#+END_SRC

Enable [[https://github.com/emacs-evil/evil-surround][surround]] everywhere.

#+BEGIN_SRC emacs-lisp
  (use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode 1))
#+END_SRC

Bind =C-p= to fuzzy-finding files in the current project.

#+BEGIN_SRC emacs-lisp
  (define-key evil-normal-state-map (kbd "C-p") 'projectile-find-file)
#+END_SRC

* UI preferences
** Tweak window chrome

 I don't usually use the menu or scroll bar, and they take up useful space.

#+BEGIN_SRC emacs-lisp
  (tool-bar-mode 0)
  (menu-bar-mode 0)
  (when window-system
    (scroll-bar-mode -1))
#+END_SRC

** Function to toggle between themes

I like the solarized-dark theme. I prefer keeping all the characters in the same
side and font, though.

#+BEGIN_SRC emacs-lisp
(defun gh/apply-solarized-theme ()
    (setq solarized-use-variable-pitch nil)
    (setq solarized-height-plus-1 1.0)
    (setq solarized-height-plus-2 1.0)
    (setq solarized-height-plus-3 1.0)
    (setq solarized-height-plus-4 1.0)
    (setq solarized-high-contrast-mode-line t)
    (load-theme 'solarized-dark t))
#+END_SRC

Define the light color theme.

#+BEGIN_SRC emacs-lisp
  (defcustom default-light-color-theme 'solarized-light
  "default light theme")
#+END_SRC

Define the dark color theme.

#+BEGIN_SRC emacs-lisp
  (defcustom default-dark-color-theme 'solarized-dark
  "default dark theme")
#+END_SRC

With this function I can toggle between the dark and the light theme.
To solve a problem with org-bullets, ensure that when changing theme org-mode restarts.

#+BEGIN_SRC emacs-lisp
  (defun gh/toggle-dark-light-theme ()
  (interactive)

  (let ((is-light (find default-light-color-theme custom-enabled-themes)))
    (dolist (theme custom-enabled-themes)
      (disable-theme theme))
    (load-theme (if is-light default-dark-color-theme default-light-color-theme))
    (if (org-mode) (org-mode-restart))))
#+END_SRC

I set the key =<f12>= to toggle between themes.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "<f12>") 'gh/toggle-dark-light-theme)
#+END_SRC

If this code is being evaluated by emacs --daemon, ensure that each subsequent frame is themed appropriately.

#+BEGIN_SRC emacs-lisp
  (if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                  (gh/apply-solarized-theme)))
  (gh/apply-solarized-theme))
#+END_SRC
** Disable visual bell

=sensible-defaults= replaces the audible bell with a visual one, but I really
don't even want that (and my Emacs/Mac pair renders it poorly). This disables
the bell altogether.

#+BEGIN_SRC emacs-lisp
  (setq ring-bell-function 'ignore)
#+END_SRC

** Scroll conservatively

When point goes outside the window, Emacs usually recenters the buffer point.
I'm not crazy about that. This changes scrolling behavior to only scroll as far
as point goes.

#+BEGIN_SRC emacs-lisp
  (setq scroll-conservatively 100)
#+END_SRC
** Highlight the current line

=global-hl-line-mode= softly highlights the background color of the line
containing point. It makes it a bit easier to find point, and it's useful when
pairing or presenting code.

#+BEGIN_SRC emacs-lisp
  (when window-system
    (global-hl-line-mode))
#+END_SRC
** Display the current column number

Display the current column.

#+BEGIN_SRC emacs-lisp
     (setq column-number-mode t)
#+END_SRC

* Publishing and task management with Org-mode
** Display preferences

I like to see an outline of pretty bullets instead of a list of asterisks.

#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :ensure t
    :init
    (add-hook 'org-mode-hook #'org-bullets-mode))
#+END_SRC

I like seeing a little downward-pointing arrow instead of the usual ellipsis
(=...=) that org displays when there's stuff under a header.

#+BEGIN_SRC emacs-lisp
  (setq org-ellipsis "⤵")
#+END_SRC

Fontify code in code blocks

#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t)
#+END_SRC

Make TAB act as if it were issued in a buffer of the language’s major mode.

#+BEGIN_SRC emacs-lisp
  (setq org-src-tab-acts-natively t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq org-src-window-setup 'current-window)
#+END_SRC

Quickly insert a block of elisp: (<el)

#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
#+END_SRC

Enable spell-checking in Org-mode. The quick brown fox jumps over the lazy dog.

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook 'flyspell-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq org-hierarchical-todo-statistics nil)
#+END_SRC
** Org-mode

Store my org files in =~/Dropbox/org/=, define the location of the index file, and archive finished tasks in =~/Dropbox/org/archive.org=.

#+BEGIN_SRC emacs-lisp
  (setq org-directory "~/Dropbox/org")
  (defun org-file-path (filename)
	  "Return the absolute address of an org file, given its relative name."
	  (concat (file-name-as-directory org-directory) filename))

  (setq org-index-file (org-file-path "index.org"))
  (setq org-archive-location
	  (concat (org-file-path "archive.org") "::* From %s"))
#+END_SRC

Derive my agenda from this directory:

#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files '("~/Dropbox/org"))
#+END_SRC

Hitting =C-c C-x C-s= will mark a todo as done and move it to an appropriate place in the archive.

#+BEGIN_SRC emacs-lisp
  (defun gh/mark-done-and-archive ()
    "Mark the state of an org-mode item as DONE and archive it."
    (interactive)
    (org-todo 'done)
    (org-archive-subtree))

  (define-key org-mode-map (kbd "C-c C-x C-s") 'gh/mark-done-and-archive)
#+END_SRC

Record the time that a todo was archived.

#+BEGIN_SRC emacs-lisp
  (setq org-log-done 'time)
#+END_SRC


*** Capturing tasks

Define a few common tasks as capture templates. Specifically, I frequently:

- Record ideas for future blog posts in =~/Dropbox/org/blog-ideas.org=,
- Maintain a todo list in =~/org/index.org=.
- Convert emails into todos to maintain an empty inbox.

#+BEGIN_SRC emacs-lisp
  (setq org-capture-templates
	'(("a" "Appointment"
	   entry
	   (file  "~/Dropbox/org/calendar.org" )
	   "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")

	  ("b" "Blog idea"
	   entry
	   (file (org-file-path "blog-ideas.org"))
	   "* %?\n")

	  ("e" "Email" entry
	   (file+headline org-index-file "Inbox")
	   "* TODO %?\n\n%a\n\n")

	  ("f" "Finished book"
	   table-line (file "~/documents/notes/books-read.org")
	   "| %^{Title} | %^{Author} | %u |")

	  ("r" "Reading"
	   checkitem
	   (file (org-file-path "to-read.org")))

	  ("s" "Subscribe to an RSS feed"
	   plain
	   (file "~/documents/rss/urls")
	   "%^{Feed URL} \"~%^{Feed name}\"")

	  ("t" "Todo"
	   entry
	   (file+headline org-index-file "Inbox")
	   "* TODO %?\n")))
#+END_SRC

When I'm starting an Org capture template I'd like to begin in insert mode. I'm
opening it up in order to start typing something, so this skips a step.

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-capture-mode-hook 'evil-insert-state)
#+END_SRC

When refiling an item, I'd like to use ido for completion.

#+BEGIN_SRC emacs-lisp
  (setq org-refile-use-outline-path t)
  (setq org-outline-path-complete-in-steps nil)
#+END_SRC
*** Keybindings

Bind a few handy keys.

#+BEGIN_SRC emacs-lisp
  (define-key global-map "\C-cl" 'org-store-link)
  (define-key global-map "\C-ca" 'org-agenda)
  (define-key global-map "\C-cc" 'org-capture)
#+END_SRC

Hit =C-c i= to quickly open up my index file.

#+BEGIN_SRC emacs-lisp
  (defun gh/open-index-file ()
    "Open the master org TODO list."
    (interactive)
    (find-file org-index-file)
    (flycheck-mode -1)
    (end-of-buffer))

  (global-set-key (kbd "C-c i") 'gh/open-index-file)
#+END_SRC

