Dropbox/emacs/configuration (gh-N550jk's conflicted copy 2018-05-12).el
(setq user-full-name "Goncalo M. V. Henriques"
user-mail-address "gmv.henriques@gmail.com")

(load-file "~/.emacs.d/sensible-defaults.el")
(sensible-defaults/use-all-settings)
(sensible-defaults/use-all-keybindings)
(sensible-defaults/backup-to-temp-directory)

(add-to-list 'load-path "~/Dropbox/emacs/lisp")

(unless (package-installed-p 'use-package)
	(package-refresh-contents)
	(package-install 'use-package))

(require 'use-package)

(use-package auto-compile
  :ensure t
  :config (auto-compile-on-load-mode))
(setq load-prefer-newer t)

(use-package evil
  :ensure t
  :init
  (evil-mode 1))

(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))

(define-key evil-normal-state-map (kbd "C-p") 'projectile-find-file)

(tool-bar-mode 0)
(menu-bar-mode 0)
(when window-system
  (scroll-bar-mode -1))

(defun gh/apply-solarized-theme ()
    (setq solarized-use-variable-pitch nil)
    (setq solarized-height-plus-1 1.0)
    (setq solarized-height-plus-2 1.0)
    (setq solarized-height-plus-3 1.0)
    (setq solarized-height-plus-4 1.0)
    (setq solarized-high-contrast-mode-line t)
    (load-theme 'solarized-dark t))

(defcustom default-light-color-theme 'solarized-light
"default light theme")

(defcustom default-dark-color-theme 'solarized-dark
"default dark theme")

(defun gh/toggle-dark-light-theme ()
(interactive)

(let ((is-light (find default-light-color-theme custom-enabled-themes)))
  (dolist (theme custom-enabled-themes)
    (disable-theme theme))
  (load-theme (if is-light default-dark-color-theme default-light-color-theme))
  (if (org-mode) (org-mode-restart))))

(global-set-key (kbd "<f12>") 'gh/toggle-dark-light-theme)

(if (daemonp)
  (add-hook 'after-make-frame-functions
            (lambda (frame)
                (gh/apply-solarized-theme)))
(gh/apply-solarized-theme))

(setq ring-bell-function 'ignore)

(setq scroll-conservatively 100)

(when window-system
  (global-hl-line-mode))

(setq column-number-mode t)

(use-package org-bullets
  :ensure t
  :init
  (add-hook 'org-mode-hook #'org-bullets-mode))

(setq org-ellipsis "⤵")

(setq org-src-fontify-natively t)

(setq org-src-tab-acts-natively t)

(setq org-src-window-setup 'current-window)

(add-to-list 'org-structure-template-alist
             '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))

(add-hook 'org-mode-hook 'flyspell-mode)

(setq org-hierarchical-todo-statistics nil)

(setq org-directory "~/Dropbox/org")
(defun org-file-path (filename)
	"Return the absolute address of an org file, given its relative name."
	(concat (file-name-as-directory org-directory) filename))

(setq org-index-file (org-file-path "index.org"))
(setq org-archive-location
	(concat (org-file-path "archive.org") "::* From %s"))

(setq org-agenda-files '("~/Dropbox/org"))

(defun gh/mark-done-and-archive ()
  "Mark the state of an org-mode item as DONE and archive it."
  (interactive)
  (org-todo 'done)
  (org-archive-subtree))

(define-key org-mode-map (kbd "C-c C-x C-s") 'gh/mark-done-and-archive)

(setq org-log-done 'time)

(setq org-capture-templates
      '(("a" "Appointment"
	 entry
	 (file  "~/Dropbox/org/calendar.org" )
	 "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")

	("b" "Blog idea"
	 entry
	 (file (org-file-path "blog-ideas.org"))
	 "* %?\n")

	("e" "Email" entry
	 (file+headline org-index-file "Inbox")
	 "* TODO %?\n\n%a\n\n")

	("f" "Finished book"
	 table-line (file "~/documents/notes/books-read.org")
	 "| %^{Title} | %^{Author} | %u |")

	("r" "Reading"
	 checkitem
	 (file (org-file-path "to-read.org")))

	("s" "Subscribe to an RSS feed"
	 plain
	 (file "~/documents/rss/urls")
	 "%^{Feed URL} \"~%^{Feed name}\"")

	("t" "Todo"
	 entry
	 (file+headline org-index-file "Inbox")
	 "* TODO %?\n")))

(add-hook 'org-capture-mode-hook 'evil-insert-state)

(setq org-refile-use-outline-path t)
(setq org-outline-path-complete-in-steps nil)

(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(define-key global-map "\C-cc" 'org-capture)

(defun gh/open-index-file ()
  "Open the master org TODO list."
  (interactive)
  (find-file org-index-file)
  (flycheck-mode -1)
  (end-of-buffer))

(global-set-key (kbd "C-c i") 'gh/open-index-file)
