Dropbox/emacs/configuration (gh-N550jk's conflicted copy 2018-05-12).org
** Sync Org-mode with Google Calendar

I use [[https://github.com/myuhe/org-gcal.el][org-gcal]] to sync my Google calendar.

#+BEGIN_SRC emacs-lisp
  (setq package-check-signature nil)


  (use-package org-gcal
    :ensure t
    :config
  (setq org-gcal-client-id "107011808994-g9s382a66p4d3f78ibkccl15sjgh7a9n.apps.googleusercontent.com"
	    org-gcal-client-secret "Gjfci0moPki0d_APpcqEL3WF"
	    org-gcal-file-alist '(("gmv.henriques@gmail.com" .  "~/Dropbox/org/calendar.org"))))

#+END_SRC

I use these two hooks to sync things semi-automatically.
The first hook syncs whenever I load the agenda. Since this happens in the background, if I just added something to my calendar, I might have to reload the agenda by hitting r in the agenda view.
The second hook syncs with my Google calendar when I capture.

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
  (add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))
#+END_SRC

[[https://github.com/kiwanami/emacs-calfw][Calfw]] it's a nice tool to view calendars in Google.

#+BEGIN_SRC emacs-lisp
  (use-package calfw
    :ensure t
    :config
    (use-package calfw-ical
    :ensure t
    :config
    (use-package calfw-org
    :ensure t
    :config
    (setq cfw:display-calendar-holidays nil)
    (defun mycalendar ()
      (interactive)
      (cfw:open-calendar-buffer
       :contents-sources
       (list
        (cfw:org-create-source "Green")
;	(cfw:ical-create-source "Gcal" "https://calendar.google.com/calendar/ical/gmv.henriques%40gmail.com/private-549e154258dff1844e9f91f62688c84b/basic.ics" "White")
	(cfw:ical-create-source "Feriados" "https://calendar.google.com/calendar/ical/pt-pt.portuguese%23holiday%40group.v.calendar.google.com/public/basic.ics" "Red")
	)))
  )
  )
  )
#+END_SRC
* Editing Settings
** Quickly visit Emacs configuration

I futz around with my dotfiles a lot. This binds =C-c e= to quickly open my
Emacs configuration file.

#+BEGIN_SRC emacs-lisp
  (defun gh/visit-emacs-config ()
    (interactive)
    (find-file "~/Dropbox/emacs/configuration.org"))

  (global-set-key (kbd "C-c e") 'gh/visit-emacs-config)
#+END_SRC

** Always kill current buffer

Assume that I always want to kill the current buffer when hitting =C-x k=.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x k") 'gh/kill-current-buffer)
#+END_SRC

** Use =company-mode= everywhere

#+BEGIN_SRC emacs-lisp
  (use-package company
  :ensure t
  :init
  (add-hook 'after-init-hook 'global-company-mode)
  )
#+END_SRC

** =Saveplace=

Purpose: When you visit a file, point goes to the last place where it was when you previously visited the same file.

#+BEGIN_SRC emacs-lisp
  (use-package saveplace
   :ensure t
   :init
   (save-place-mode 1)
  )
#+END_SRC

[[https://www.emacswiki.org/emacs/SavePlace][Save Place]]
** Always indent with spaces

Never use tabs. Tabs are the devil’s whitespace.

#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil)
#+END_SRC

** Configure =yasnippet=

I keep my snippets in =~/Dropbox/emacs/snippets/text-mode=, and I always want =yasnippet= enabled.

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
  :ensure t
  :init
    (setq yas-snippet-dirs '("~/Dropbox/emacs/snippets/text-mode"))
    (yas-global-mode 1))
#+END_SRC

I don’t want =ido= to automatically indent the snippets it inserts. Sometimes this looks pretty bad (when indenting org-mode, for example, or trying to guess at the correct indentation for Python).

#+BEGIN_SRC emacs-lisp
  (setq yas/indent-line nil)
#+END_SRC
** Configure =ido=

#+BEGIN_SRC emacs-lisp
  (use-package ido
    :ensure t
    :init
    (setq ido-enable-flex-matching t)
    (setq ido-everywhere t)
    (ido-mode 1)

    (use-package flx-ido
      :ensure t
      :init
      (flx-ido-mode 1) ; better/faster matching
    )

  (setq ido-create-new-buffer 'always) ; don't confirm to create new buffers

    (use-package ido-vertical-mode
      :ensure t
      :init
      (ido-vertical-mode 1)
      (setq ido-vertical-define-keys 'C-n-and-C-p-only)
    )
  )
#+END_SRC

[[https://www.emacswiki.org/emacs/InteractivelyDoThings][ido]]
[[https://github.com/lewang/flx][flx-ido]]
[[https://github.com/creichert/ido-vertical-mode.el][ido-vertical-mode]]
** Electric pair

Typing any left bracket automatically insert the right matching bracket.

#+BEGIN_SRC emacs-lisp
  (electric-pair-mode 1)
#+END_SRC
** Rainbow-delimiters

#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :commands rainbow-delimiters-mode
    :init
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
    (add-hook 'LaTex-mode-hook #'rainbow-delimiters-mode)
    (add-hook 'org-mode-hook 'rainbow-delimiters-mode))
#+END_SRC

** Use =smex= to handle =M-x= with =ido=

#+BEGIN_SRC emacs-lisp
  (use-package smex
    :ensure t
    :init
    (smex-initialize)
  )

  (global-set-key (kbd "M-x") 'smex)
  (global-set-key (kbd "M-X") 'smex-major-mode-commands)
#+END_SRC

** Switch and rebalance windows when splitting

When splitting a window, I invariably want to switch to the new window. This makes that automatic.

#+BEGIN_SRC emacs-lisp
   (defun gh/split-window-below-and-switch ()
    "Split the window horizontally, then switch to the new pane."
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun gh/split-window-right-and-switch ()
    "Split the window vertically, then switch to the new pane."
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))

  (global-set-key (kbd "C-x 2") 'gh/split-window-below-and-switch)
  (global-set-key (kbd "C-x 3") 'gh/split-window-right-and-switch)
#+END_SRC
* Writing
** Change dictionary

Change dictionary to =PT-preao=

#+BEGIN_SRC emacs-lisp
(global-set-key
[f3]
(lambda ()
    (interactive)
    (ispell-change-dictionary "pt_PT-preao")))
#+END_SRC

Change dictionary to =En=

#+BEGIN_SRC emacs-lisp
(global-set-key
[f4]
(lambda ()
    (interactive)
    (ispell-change-dictionary "en")))
#+END_SRC
** Wrap paragraphs automatically

=AutoFillMode= automatically wraps paragraphs.

#+BEGIN_SRC emacs-lisp
  (add-hook 'text-mode-hook 'turn-on-auto-fill)
  (add-hook 'gfm-mode-hook 'turn-on-auto-fill)
  (add-hook 'org-mode-hook 'turn-on-auto-fill)
  (add-hook 'latex-mode-hook 'turn-on-auto-fill)
  (add-hook 'LaTeX-mode-hook 'turn-on-auto-fill)
#+END_SRC

Sometimes, though, I don’t wanna wrap text. This toggles wrapping with =C-c q=:

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c q") 'auto-fill-mode)
#+END_SRC
** =Flyspell-popup=

Call flyspell-popup-correct to correct misspelled word at point with a Popup
Menu. You might want to bind it to a short key, for example:

#+BEGIN_SRC emacs-lisp
    (use-package flyspell-popup
    :ensure t
    :init
    (define-key flyspell-mode-map (kbd "C-;") #'flyspell-popup-correct))
#+END_SRC
* Email with =mu4e=
** Evil
Use the evil bindings for navigation. They’re very similar to the mutt bindings,
which matches my muscle memory nicely. =)

#+BEGIN_SRC emacs-lisp
  (require 'evil-mu4e)
#+END_SRC
** Where’s my mail? Who am I?
I keep my mail in =~/.mail=. The default mail directory would be =~/Maildir=, but I’d rather hide it; I don’t poke around in there manually very often.

This setting matches the paths in my mbsync configuration.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-maildir "~/.mail")
#+END_SRC

I only have one context at the moment. If I had another email account, though,
I’d define it in here with an additional =make-mu4e-context= block.

My full name is defined earlier in this configuration file.

#+BEGIN_SRC emacs-lisp
(setq mu4e-contexts
      `(,(make-mu4e-context
          :name "gmail"
          :match-func (lambda (msg)
                        (when msg
                          (string-prefix-p "/gmail" (mu4e-message-field msg :maildir))))
          :vars '((user-mail-address . "gmv.henriques@gmail.com")
                  (mu4e-trash-folder . "/gmail/archive")
                  (mu4e-refile-folder . "/gmail/archive")
                  (mu4e-sent-folder . "/gmail/sent")
                  (mu4e-drafts-folder . "/gmail/drafts")))))
#+END_SRC
** Fetching new mail

I fetch my email with =mbsync=. I’ve also bound “o” to fetch new mail.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-get-mail-command "killall --quiet mbsync; mbsync inboxes")

  (define-key mu4e-headers-mode-map (kbd "o") 'mu4e-update-mail-and-index)
#+END_SRC

Rename files when moving them between directories. =mbsync= supposedly prefers
this; I’m cargo-culting.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-change-filenames-when-moving t)
#+END_SRC

Poll the server for new mail every 1 minute.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-update-interval 60)
#+END_SRC
** Viewing mail

I check my email pretty often! Probably more than I should. This binds =C-c m=
to close any other windows and open my personal inbox.

In practice, I keep an *mu4e-headers* buffer in its own frame, full-screen, on a
dedicated i3 workspace.

#+BEGIN_SRC emacs-lisp
  (defun gh/visit-inbox ()
    (interactive)
    (delete-other-windows)
    (mu4e~headers-jump-to-maildir "/gmail/inbox"))

  (global-set-key (kbd "C-c m") 'gh/visit-inbox)
#+END_SRC

Open my inbox and sent messages folders with =J-i= and =J-s=, respectively.
These are the only two folders I visit regularly enough to warrant shortcuts.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-maildir-shortcuts '(("/gmail/inbox" . ?i)
                               ("/gmail/sent" . ?s)))
#+END_SRC

=mu4e= starts approximately instantaneously, so I don’t know why I’d want to
reconsider quitting it.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-confirm-quit nil)
#+END_SRC
** Composing a new message
When I’m composing a new email, default to using the first context.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-compose-context-policy 'pick-first)
#+END_SRC

Compose new messages (as with =C-x m=) using =mu4e-user-agent=.

#+BEGIN_SRC emacs-lisp
  (setq mail-user-agent 'mu4e-user-agent)
#+END_SRC

Enable Org-style tables and list manipulation.

#+BEGIN_SRC emacs-lisp
  (add-hook 'message-mode-hook 'turn-on-orgtbl)
  (add-hook 'message-mode-hook 'turn-on-orgstruct++)
#+END_SRC

Check my spelling while I'm writing.

#+BEGIN_SRC emacs-lisp
  (add-hook 'mu4e-compose-mode-hook 'flyspell-mode)
#+END_SRC

Once I've sent an email, kill the associated buffer instead of just burying it.

#+BEGIN_SRC emacs-lisp
  (setq message-kill-buffer-on-exit t)
#+END_SRC

