Dropbox/emacs/configuration (gh-N550jk's conflicted copy 2018-05-12).el

(setq package-check-signature nil)


(use-package org-gcal
  :ensure t
  :config
(setq org-gcal-client-id "107011808994-g9s382a66p4d3f78ibkccl15sjgh7a9n.apps.googleusercontent.com"
	  org-gcal-client-secret "Gjfci0moPki0d_APpcqEL3WF"
	  org-gcal-file-alist '(("gmv.henriques@gmail.com" .  "~/Dropbox/org/calendar.org"))))

(add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
(add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))

(use-package calfw
    :ensure t
    :config
    (use-package calfw-ical
    :ensure t
    :config
    (use-package calfw-org
    :ensure t
    :config
    (setq cfw:display-calendar-holidays nil)
    (defun mycalendar ()
      (interactive)
      (cfw:open-calendar-buffer
       :contents-sources
       (list
        (cfw:org-create-source "Green")
;	(cfw:ical-create-source "Gcal" "https://calendar.google.com/calendar/ical/gmv.henriques%40gmail.com/private-549e154258dff1844e9f91f62688c84b/basic.ics" "White")
	(cfw:ical-create-source "Feriados" "https://calendar.google.com/calendar/ical/pt-pt.portuguese%23holiday%40group.v.calendar.google.com/public/basic.ics" "Red")
	)))
  )
  )
  )

(defun gh/visit-emacs-config ()
  (interactive)
  (find-file "~/Dropbox/emacs/configuration.org"))

(global-set-key (kbd "C-c e") 'gh/visit-emacs-config)

(global-set-key (kbd "C-x k") 'gh/kill-current-buffer)

(use-package company
:ensure t
:init
(add-hook 'after-init-hook 'global-company-mode)
)

(use-package saveplace
 :ensure t
 :init
 (save-place-mode 1)
)

(setq-default indent-tabs-mode nil)

(use-package yasnippet
:ensure t
:init
  (setq yas-snippet-dirs '("~/Dropbox/emacs/snippets/text-mode"))
  (yas-global-mode 1))

(setq yas/indent-line nil)

(use-package ido
  :ensure t
  :init
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (ido-mode 1)

  (use-package flx-ido
    :ensure t
    :init
    (flx-ido-mode 1) ; better/faster matching
  )

(setq ido-create-new-buffer 'always) ; don't confirm to create new buffers

  (use-package ido-vertical-mode
    :ensure t
    :init
    (ido-vertical-mode 1)
    (setq ido-vertical-define-keys 'C-n-and-C-p-only)
  )
)

(electric-pair-mode 1)

(use-package rainbow-delimiters
  :ensure t
  :commands rainbow-delimiters-mode
  :init
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'LaTex-mode-hook #'rainbow-delimiters-mode)
  (add-hook 'org-mode-hook 'rainbow-delimiters-mode))

(use-package smex
  :ensure t
  :init
  (smex-initialize)
)

(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)

(defun gh/split-window-below-and-switch ()
  "Split the window horizontally, then switch to the new pane."
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))

(defun gh/split-window-right-and-switch ()
  "Split the window vertically, then switch to the new pane."
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))

(global-set-key (kbd "C-x 2") 'gh/split-window-below-and-switch)
(global-set-key (kbd "C-x 3") 'gh/split-window-right-and-switch)

(global-set-key
[f3]
(lambda ()
    (interactive)
    (ispell-change-dictionary "pt_PT-preao")))

(global-set-key
[f4]
(lambda ()
    (interactive)
    (ispell-change-dictionary "en")))

(add-hook 'text-mode-hook 'turn-on-auto-fill)
(add-hook 'gfm-mode-hook 'turn-on-auto-fill)
(add-hook 'org-mode-hook 'turn-on-auto-fill)
(add-hook 'latex-mode-hook 'turn-on-auto-fill)
(add-hook 'LaTeX-mode-hook 'turn-on-auto-fill)

(global-set-key (kbd "C-c q") 'auto-fill-mode)

(use-package flyspell-popup
:ensure t
:init
(define-key flyspell-mode-map (kbd "C-;") #'flyspell-popup-correct))

(require 'evil-mu4e)

(setq mu4e-maildir "~/.mail")

(setq mu4e-contexts
      `(,(make-mu4e-context
          :name "gmail"
          :match-func (lambda (msg)
                        (when msg
                          (string-prefix-p "/gmail" (mu4e-message-field msg :maildir))))
          :vars '((user-mail-address . "gmv.henriques@gmail.com")
                  (mu4e-trash-folder . "/gmail/archive")
                  (mu4e-refile-folder . "/gmail/archive")
                  (mu4e-sent-folder . "/gmail/sent")
                  (mu4e-drafts-folder . "/gmail/drafts")))))

(setq mu4e-get-mail-command "killall --quiet mbsync; mbsync inboxes")

(define-key mu4e-headers-mode-map (kbd "o") 'mu4e-update-mail-and-index)

(setq mu4e-change-filenames-when-moving t)

(setq mu4e-update-interval 60)

(defun gh/visit-inbox ()
  (interactive)
  (delete-other-windows)
  (mu4e~headers-jump-to-maildir "/gmail/inbox"))

(global-set-key (kbd "C-c m") 'gh/visit-inbox)

(setq mu4e-maildir-shortcuts '(("/gmail/inbox" . ?i)
                             ("/gmail/sent" . ?s)))

(setq mu4e-confirm-quit nil)

(setq mu4e-compose-context-policy 'pick-first)

(setq mail-user-agent 'mu4e-user-agent)

(add-hook 'message-mode-hook 'turn-on-orgtbl)
(add-hook 'message-mode-hook 'turn-on-orgstruct++)

(add-hook 'mu4e-compose-mode-hook 'flyspell-mode)

(setq message-kill-buffer-on-exit t)
