Dropbox/emacs/configuration (gh-N550jk's conflicted copy 2018-05-12).org
** Reading an email

Display the sender's email address along with their name.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-view-show-addresses t)
#+END_SRC

Save attachments in my =~/downloads= directory, not my home directory.

#+BEGIN_SRC emacs-lisp
  (setq mu4e-attachment-dir "~/downloads")
#+END_SRC

Hit =C-c C-o= to open a URL in the browser.

#+BEGIN_SRC emacs-lisp
  (define-key mu4e-view-mode-map (kbd "C-c C-o") 'mu4e~view-browse-url-from-binding)
#+END_SRC

While HTML emails are undeniably sinful, we often have to read them. That's
sometimes best done in a browser. This effectively binds =a h= to open the
current email in my default Web browser.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'mu4e-view-actions '("html in browser" . mu4e-action-view-in-browser) t)
#+END_SRC

** Encryption

If a message is encrypted, my reply should always be encrypted, too.

#+BEGIN_SRC emacs-lisp
  (defun gh/encrypt-responses ()
    (let ((msg mu4e-compose-parent-message))
      (when msg
        (when (member 'encrypted (mu4e-message-field msg :flags))
          (mml-secure-message-encrypt-pgpmime)))))

  (add-hook 'mu4e-compose-mode-hook 'gh/encrypt-responses)
#+END_SRC

** Sending mail over SMTP

I send my email through =msmtp=. It's very fast, and I've already got it
configured from using =mutt=. These settings describe how to send a message:

- Use a sendmail program instead of sending directly from Emacs,
- Tell =msmtp= to infer the correct account from the =From:= address,
- Don't add a "=-f username=" flag to the =msmtp= command, and
- Use =/usr/bin/msmtp=!

#+BEGIN_SRC emacs-lisp
  (setq message-send-mail-function 'message-send-mail-with-sendmail)
  (setq message-sendmail-extra-arguments '("--read-envelope-from"))
  (setq message-sendmail-f-is-evil 't)
  (setq sendmail-program "msmtp")
#+END_SRC

** Org integration

=org-mu4e= lets me store links to emails. I use this to reference emails in my
TODO list while keeping my inbox empty.

#+BEGIN_SRC emacs-lisp
  (require 'org-mu4e)
#+END_SRC

When storing a link to a message in the headers view, link to the message
instead of the search that resulted in that view.

#+BEGIN_SRC emacs-lisp
  (setq org-mu4e-link-query-in-headers-mode nil)
#+END_SRC
** Configure BBDB with mu4e

Use BBDB to handle my address book.

#+BEGIN_SRC emacs-lisp
  (require 'bbdb-mu4e)
#+END_SRC

Don’t try to do address completion with mu4e. Use BBDB instead:

#+BEGIN_SRC emacs-lisp
  (setq mu4e-compose-complete-addresses nil)
#+END_SRC
** Try to display images in mu4e

#+BEGIN_SRC emacs-lisp
  (setq
   mu4e-view-show-images t
   mu4e-view-image-max-width 800)
#+END_SRC
* My =latex= environment
** =Auctex=

#+BEGIN_SRC emacs-lisp
  (use-package tex-site
    :ensure auctex
    :mode ("\\.tex\\'" . latex-mode)
    :config
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq-default TeX-master nil)
    (add-hook 'LaTeX-mode-hook
              (lambda ()
                (rainbow-delimiters-mode)
                (turn-on-reftex)
                (setq reftex-plug-into-AUCTeX t)
                (reftex-isearch-minor-mode)
                (setq TeX-PDF-mode t)
                (setq TeX-source-correlate-method 'synctex)
                (setq TeX-source-correlate-start-server t)))

  ;; Update PDF buffers after successful LaTeX runs
  (add-hook 'TeX-after-TeX-LaTeX-command-finished-hook
             #'TeX-revert-document-buffer)

  ;; to use pdfview with auctex
  (add-hook 'LaTeX-mode-hook 'pdf-tools-install)

  ;; to use pdfview with auctex
  (setq TeX-view-program-selection '((output-pdf "pdf-tools"))
         TeX-source-correlate-start-server t)
  (setq TeX-view-program-list '(("pdf-tools" "TeX-pdf-tools-sync-view"))))
#+END_SRC
** =Reftex=

#+BEGIN_SRC emacs-lisp
  (use-package reftex
    :ensure t
    :defer t
    :config
    (setq reftex-cite-prompt-optional-args t)); Prompt for empty optional arguments in cite
#+END_SRC
** =Ivy-bibtex=
** =Pdf-tools=
#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools
    :ensure t
    :mode ("\\.pdf\\'" . pdf-tools-install)
    :bind ("C-c C-g" . pdf-sync-forward-search)
    :defer t
    :config
    (setq mouse-wheel-follow-mouse t)
    (setq pdf-view-resize-factor 1.10))
#+END_SRC
* =Elfeed=

#+BEGIN_SRC emacs-lisp
  (use-package elfeed-org
    :ensure t
    :config
    (progn
      (elfeed-org)
      (setq rmh-elfeed-org-files (list "~/Dropbox/org/feeds.org"))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package elfeed)
    :ensure t
#+END_SRC
* Header

Time-stamp!

#+BEGIN_SRC emacs-lisp

(add-hook 'before-save-hook 'time-stamp)

(setq
  time-stamp-pattern nil
  time-stamp-active t          ; do enable time-stamps
  time-stamp-line-limit 12     ; check first 10 buffer lines for Time-stamp:
  time-stamp-format "%04y-%02m-%02d %02H:%02M:%02S (%u)") ; date format
#+END_SRC

=Header2.el=!

#+BEGIN_SRC emacs-lisp

  (use-package header2
    :config
    (progn

      (defconst gh/header-sep-line-char ?-
        "Character to be used for creating separator lines in header.")

      (defconst gh/header-border-line-char ?=
        "Character to be used for creating border lines in header.")

      (defconst gh/auto-headers-hooks '(latex-mode-hook
                                        LaTeX-mode-hook)
        "List of hooks of major modes in which headers should be auto-inserted.")

      (defvar gh/header-timestamp-cond (lambda () t)
        "This variable should be set to a function that returns a non-nil
        value only when the time stamp is supposed to be inserted. By default, it's
        a `lambda' return `t', so the time stamp is always inserted.")

      (defun gh/turn-on-auto-headers ()
        "Turn on auto headers only for specific modes."
        (interactive)
        (dolist (hook gh/auto-headers-hooks)
          (add-hook hook #'auto-make-header)))

      (defun gh/turn-off-auto-headers ()
        "Turn off auto headers only for specific modes."
        (interactive)
        (dolist (hook gh/auto-headers-hooks)
          (remove-hook hook #'auto-make-header)))


      (defsubst gh/header-sep-line ()
        "Insert separator line"
        (insert header-prefix-string)
        (insert-char gh/header-sep-line-char (- fill-column (current-column)))
        (insert "\n"))

      (defsubst gh/header-border-line ()
        "Insert separator line"
        (insert header-prefix-string)
        (insert-char gh/header-border-line-char (- fill-column (current-column)))
        (insert "\n"))


      (defsubst gh/header-file-name ()
        "Insert \"File Name\" line, using buffer's file name."
        (insert header-prefix-string "File Name          : "
                (if (buffer-file-name)
                    (file-name-nondirectory (buffer-file-name))
                  (buffer-name))
                "\n"))

      (defsubst gh/header-author ()
        "Insert current user's name (`user-full-name') as this file's author."
        (insert header-prefix-string "Author             : "
                (user-full-name)
                "\n"))

      (defsubst gh/header-mail ()
        "Insert current user's name (`user-mail-address') as this file's author."
        (insert header-prefix-string "Author e-mail      : "
                user-mail-address
                "\n"))

      (defsubst gh/header-description ()
        "Insert \"Description\" line."
        (insert header-prefix-string "Description        : \n"))

      (defsubst gh/header-creation-date ()
        "Insert todays date as the time of last modification."
        (insert header-prefix-string "Created            : "
                (header-date-string)
                "\n"))

      (defsubst gh/header-timestamp ()
        "Insert field for time stamp."
        (when (funcall gh/header-timestamp-cond)
        (insert header-prefix-string "Time-stamp: <>\n")))

      (defsubst gh/header-modification-date ()
        "Insert todays date as the time of last modification.
         This is normally overwritten with each file save."
        (insert header-prefix-string "Last-Updated       :"
                "\n"))


      (defsubst gh/header-position-point ()
        "Position the point at a particular point in the file.
  Bring the point 2 lines below the current point."
        (forward-line 0)
        (newline 2))


      (setq make-header-hook '(gh/header-border-line
                               header-blank
                               gh/header-file-name
                               gh/header-author
                               gh/header-mail
                               gh/header-creation-date
                               header-blank
                               gh/header-sep-line
                               header-blank
                               gh/header-timestamp
                               header-blank
                               gh/header-sep-line
                               header-blank
                               gh/header-description
                               header-blank
                               gh/header-border-line
                               gh/header-position-point))
      (gh/turn-on-auto-headers)
      ))

#+END_SRC

