Dropbox/emacs/configuration (gh-N550jk's conflicted copy 2018-05-12).org
* =Dired=
Load up the assorted =dired= extensions.

#+BEGIN_SRC emacs-lisp
  (use-package dired-details)
  (use-package dired+)
#+END_SRC

Open media with the appropriate programs.

#+BEGIN_SRC emacs-lisp
  (use-package dired-open
    :config
    (setq dired-open-extensions
          '(("pdf" . "evince")
            ("mkv" . "vlc")
            ("mp4" . "vlc")
            ("avi" . "vlc"))))
#+END_SRC

These are the switches that get passed to =ls= when =dired= gets a list of
files. We’re using:

- =l=: Use the long listing format.
- =h=: Use human-readable sizes.
- =v=: Sort numbers naturally.
- =A=: Almost all. Doesn't include "=.=" or "=..=".

#+BEGIN_SRC emacs-lisp
  (setq-default dired-listing-switches "-lhvA")
#+END_SRC

Use "j" and "k" to move around in =dired=.

#+BEGIN_SRC emacs-lisp
  (evil-define-key 'normal dired-mode-map (kbd "j") 'dired-next-line)
  (evil-define-key 'normal dired-mode-map (kbd "k") 'dired-previous-line)
#+END_SRC

Kill buffers of files/directories that are deleted in =dired=.

#+BEGIN_SRC emacs-lisp
  (setq dired-clean-up-buffers-too t)
#+END_SRC

Always copy directories recursively instead of asking every time.

#+BEGIN_SRC emacs-lisp
  (setq dired-recursive-copies 'always)
#+END_SRC

Ask before recursively /deleting/ a directory, though.

#+BEGIN_SRC emacs-lisp
  (setq dired-recursive-deletes 'top)
#+END_SRC

Open a file with an external program (that is, through =xdg-open=) by hitting
=C-c C-o=.

#+BEGIN_SRC emacs-lisp
  (defun dired-xdg-open ()
    "In dired, open the file named on this line."
    (interactive)
    (let* ((file (dired-get-filename nil t)))
      (call-process "xdg-open" nil 0 nil file)))

  (define-key dired-mode-map (kbd "C-c C-o") 'dired-xdg-open)
#+END_SRC
* Projectile

#+BEGIN_SRC emacs-lisp
(use-package projectile
  :ensure t
  :config
  (projectile-global-mode))
#+END_SRC
* Hydra

#+BEGIN_SRC emacs-lisp
  (use-package hydra
    :ensure t)


(global-set-key
 (kbd "<f2>")
(defhydra mz/hydra-elfeed ()
   "filter"
   ("o" (elfeed-search-set-filter "@6-months-ago +other") "other")
   ("e" (elfeed-search-set-filter "@6-months-ago +emacs") "emacs")
   ("t" (elfeed-search-set-filter "@6-months-ago +Technology") "technology")
   ("c" (elfeed-search-set-filter "@6-months-ago +ComputerScience") "computerscience")
   ("s" (elfeed-search-set-filter "@6-months-ago +Science") "science")
   ("p" (elfeed-search-set-filter "@6-months-ago +Pens") "pens")
   ("l" (elfeed-search-set-filter "@6-months-ago +Latex") "latex")
   ("n" (elfeed-search-set-filter "@6-months-ago +News") "news")
   ("u" (elfeed-search-set-filter "@6-months-ago +Music") "music")
   ("d" (elfeed-search-set-filter "@6-months-ago +Podcast") "podcast")
   ("m" (elfeed-search-set-filter "@6-months-ago +Medicine") "medicine")
   ("*" (elfeed-search-set-filter "@6-months-ago +star") "Starred")
   ("M" elfeed-toggle-star "Mark")
   ("A" (elfeed-search-set-filter "@6-months-ago") "All")
   ("T" (elfeed-search-set-filter "@1-day-ago") "Today")
   ("Q" bjm/elfeed-save-db-and-bury "Quit Elfeed" :color blue)
   ("q" nil "quit" :color blue)
   ))
#+END_SRC
