Dropbox/emacs/configuration (gh-N550jk's conflicted copy 2018-05-12).el

(use-package dired-details)
(use-package dired+)

(use-package dired-open
  :config
  (setq dired-open-extensions
        '(("pdf" . "evince")
          ("mkv" . "vlc")
          ("mp4" . "vlc")
          ("avi" . "vlc"))))

(setq-default dired-listing-switches "-lhvA")

(evil-define-key 'normal dired-mode-map (kbd "j") 'dired-next-line)
(evil-define-key 'normal dired-mode-map (kbd "k") 'dired-previous-line)

(setq dired-clean-up-buffers-too t)

(setq dired-recursive-copies 'always)

(setq dired-recursive-deletes 'top)

(defun dired-xdg-open ()
  "In dired, open the file named on this line."
  (interactive)
  (let* ((file (dired-get-filename nil t)))
    (call-process "xdg-open" nil 0 nil file)))

(define-key dired-mode-map (kbd "C-c C-o") 'dired-xdg-open)

(use-package projectile
  :ensure t
  :config
  (projectile-global-mode))

(use-package hydra
    :ensure t)


(global-set-key
 (kbd "<f2>")
(defhydra mz/hydra-elfeed ()
   "filter"
   ("o" (elfeed-search-set-filter "@6-months-ago +other") "other")
   ("e" (elfeed-search-set-filter "@6-months-ago +emacs") "emacs")
   ("t" (elfeed-search-set-filter "@6-months-ago +Technology") "technology")
   ("c" (elfeed-search-set-filter "@6-months-ago +ComputerScience") "computerscience")
   ("s" (elfeed-search-set-filter "@6-months-ago +Science") "science")
   ("p" (elfeed-search-set-filter "@6-months-ago +Pens") "pens")
   ("l" (elfeed-search-set-filter "@6-months-ago +Latex") "latex")
   ("n" (elfeed-search-set-filter "@6-months-ago +News") "news")
   ("u" (elfeed-search-set-filter "@6-months-ago +Music") "music")
   ("d" (elfeed-search-set-filter "@6-months-ago +Podcast") "podcast")
   ("m" (elfeed-search-set-filter "@6-months-ago +Medicine") "medicine")
   ("*" (elfeed-search-set-filter "@6-months-ago +star") "Starred")
   ("M" elfeed-toggle-star "Mark")
   ("A" (elfeed-search-set-filter "@6-months-ago") "All")
   ("T" (elfeed-search-set-filter "@1-day-ago") "Today")
   ("Q" bjm/elfeed-save-db-and-bury "Quit Elfeed" :color blue)
   ("q" nil "quit" :color blue)
   ))
